ЕРПУХАстенд.cbr_Основной/src/DataProcessors/СостояниеОбеспеченияЗаказов/СостояниеОбеспеченияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8f1ab9e-891d-4c1b-ad4c-1e371b6f0cbf">
  <name>СостояниеОбеспеченияЗаказов</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

ЕРПУХАстенд.cbr_Основной/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="48a11946-4d50-41a7-919b-49bf18403be5">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9b0356bb-5966-4577-ab5a-bbc09ae9323b">
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="cd44cebd-862f-40b1-a297-247d05c45d2f">
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="970e966f-77d3-4ec1-9ca5-f2f5a2a8e2d1">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="865e7fe8-0ba5-430f-8819-98ee2644d5c5">
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04b45cc8-19da-4fc2-ab25-fcf16e66f5ee">
  <name>ЗаказНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГосЗаказ</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеТребования</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="15fca05d-7959-4a2b-9062-e424f3982539">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6df6fc76-a3cd-4de0-a023-25f5c09faf10">
    <name>НачатьНеРанее</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91b5bd8a-a202-4ee3-a07e-d2244bd4d2bb">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8b15-f8e1-48f5-a895-0a0068c7711a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25c088f7-7f66-4e72-9549-39343550e4b5">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff56eabe-a6d5-4725-a7e1-6d3c1cffefbc">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="191fc3ee-3065-4648-ad89-72b3cbf6a108">
    <name>ДатаПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88a5e505-c602-47c9-9dd8-4b109bf0874f">
    <name>ДинамическаяСтруктура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb924568-6ab5-4bc3-9ed4-53888e5a2470">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0190487c-4b35-4793-bebb-cdc5d67bf079">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a32405d7-b213-4b91-8842-bc3b27c23a17">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dd131bed-f4cf-4ccb-8427-639b59bd5bf2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a6e457f-9de3-483b-9f11-8235c0db3365">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ce2f7918-6eb6-44a1-9703-eaa30ed728d8">
      <name>Спецификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8fb6ec89-8b54-4467-a7ee-20b1f54a8233">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="03503ac6-a4b9-4d70-b0ef-949dac7b8de4">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="38ea66f4-5bfa-48f1-8431-a99d27fcf31d">
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d4429caf-ac6e-49ad-bef0-355badcab738">
    <name>КоличествоУпаковокПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e4bc4c5c-4c75-4666-8d21-f7f403a23514">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cef36287-09dd-4448-9e9e-5c90a8111d2c">
    <name>НаименованиеЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Очередь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>15</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e9606203-88e5-4b62-bc25-9f152c0eecfe">
    <name>ПартияПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9e76279a-4f34-44a9-b997-752bfa2a4a30">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d12a6578-0ee7-4c40-a0c0-f24b03afa6bc">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0662487e-07e7-4fe3-b008-ffb293a9f154">
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49fb8c7a-a984-433d-9013-98b3f1808eba">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2e72bf9d-e251-478c-bd3e-7fb8e78584c0">
    <name>ТребуетсяЗаполнитьПоОперациям</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88bb5796-07b6-4854-bafc-05701368c7dc">
    <name>ФактическоеНачалоЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97258e31-badf-4c52-808f-88d24f4369d1">
    <name>ФактическоеОкончаниеЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d65a15ce-a56d-4017-bbbc-210858c2c05f">
    <name>Этап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="273df2c3-514f-4b41-af58-a60420b68979">
    <name>КоличествоУпаковокФакт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>П3_СлужебныйПересчетВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_СтатусДоКонтроля</name>
    <type>
      <types>EnumRef.СтатусыЭтаповПроизводства2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДатаДокументКотнроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ВремяКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТехПотери</name>
    <comment>//++ ШмелевР 04.03.2026 ПРЗ.3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_Брак</name>
    <comment>//++ ШмелевР 04.03.2026 ПРЗ.3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Действия</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершенияПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершенияФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеноПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеноФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТемператураПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТемператураФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДавлениеПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДавлениеФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращенияПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращенияФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f0cdedc1-9f3a-4821-ab6c-f2792fa18854">
    <name>ВыходныеИзделияСерии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="028a2250-ffdf-406c-868f-fb624d295146">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="96e6c801-bf9a-48f0-9e19-1f68a05fe6eb">
    <name>ОбеспечениеМатериаламиИРаботами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2849e137-bfbf-4c16-b65f-8183ef3dcfd6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e615f87c-b1fe-424a-ba73-2107af37992d">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc5c02ab-4758-47ca-a469-aeac95072209">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="dc035f49-1f37-4bf6-a369-751f132442a2">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="20aa6e93-6a18-4526-830f-8d45d3e04bb6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>П3_НазначениеДоПересчета</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/DataProcessors/СостояниеОбеспеченияЗаказов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура cbr_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ СкребковЮМ 11.03.26
	Если ЗначениеЗаполнено(КонтекстИспользования) Тогда
		cbr_ПодготовитьФорму();
	КонецЕсли;
	//-- СкребковЮМ 11.03.26
КонецПроцедуры

#КонецОбласти

#Область НастройкаСписков

&ИзменениеИКонтроль("ТекстЗапроса")
&НаСервере
Функция cbr_ТекстЗапроса(ИмяЭлемента, ПодменятьТекущийЗаказ)
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)
		|					И СостояниеЗаказа.Зарезервировано > 0 ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		ИНАЧЕ СостояниеЗаказа.Состояние
		|	КОНЕЦ КАК Состояние,
		|	СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)
		|		И СостояниеЗаказа.Зарезервировано > 0 И СостояниеЗаказа.Обеспечено > 0 КАК ЗарезервированоИОбеспеченоОдновременно,
		|	СостояниеЗаказа.Номенклатура                                КАК Номенклатура,
		|	СостояниеЗаказа.Номенклатура.ТипНоменклатуры                КАК ТипНоменклатуры,
		|	СостояниеЗаказа.Характеристика                              КАК Характеристика,
		|	СостояниеЗаказа.Склад                                       КАК Склад,
		|	СостояниеЗаказа.Назначение                                  КАК Назначение,
		|	СостояниеЗаказа.ЖелаемаяДатаОтгрузки                        КАК ЖелаемаяДатаОтгрузки,
		|	СостояниеЗаказа.ЗаказНаПоступление                          КАК ЗаказНаПоступление,
		#Вставка
		//++ СкребковЮМ 11.03.26
		|	ВЫБОР КОГДА СостояниеЗаказа.ЗаказНаОтгрузку ССЫЛКА Документ.ЗаказКлиента
		|		ТОГДА ВЫРАЗИТЬ(СостояниеЗаказа.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента).Автор
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	КОНЕЦ 														КАК Автор,
		|	ВЫБОР КОГДА СостояниеЗаказа.ЗаказНаПоступление ССЫЛКА Документ.ЗаказНаПроизводство2_2
		|			ТОГДА НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СостояниеЗаказа.ЗаказНаПоступление КАК Документ.ЗаказНаПроизводство2_2).Дата, ДЕНЬ)
		|		  КОГДА СостояниеЗаказа.ЗаказНаПоступление ССЫЛКА Документ.ЭтапПроизводства2_2 ТОГДА 
		|			НАЧАЛОПЕРИОДА(РаспоряжениеПоЭтапу.Дата, ДЕНЬ)
		|		  ИНАЧЕ
		|		    ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ 														КАК ДатаЗаказаНаПроизводство,
		|	ВЫБОР КОГДА СостояниеЗаказа.ЗаказНаОтгрузку ССЫЛКА Документ.ЗаказКлиента
		|		ТОГДА ВЫРАЗИТЬ(СостояниеЗаказа.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента)
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	КОНЕЦ														КАК ЗаказКлиента,
		|	ВЫБОР КОГДА СостояниеЗаказа.ЗаказНаОтгрузку ССЫЛКА Документ.ЗаказКлиента
		|		ТОГДА НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СостояниеЗаказа.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента).cbr_ДатаПостановкиВПлан, ДЕНЬ)
		|	ИНАЧЕ
		|		 ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ														КАК ДатаПостановкиВПлан,
		//-- СкребковЮМ 11.03.26
		#КонецВставки
		|	СостояниеЗаказа.Зарезервировано + СостояниеЗаказа.Обеспечено + СостояниеЗаказа.НеОбеспечено КАК Количество,
		|	&ЗаказНаОтгрузкуПереопределяемый                            КАК ЗаказНаОтгрузку,
		|	РеестрДокументов.Партнер                                    КАК Клиент,
		|	РеестрДокументов.Ответственный                              КАК Менеджер,
		|
		// Производные поля.
		|	СостояниеЗаказа.Номенклатура.ЕдиницаИзмерения                              КАК ЕдиницаИзмерения,
		|	СостояниеЗаказа.Назначение.Заказ                                           КАК ЗаказНазначения,
		|	СостояниеЗаказа.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Обособленно,
		|
		// Поле Действие.
		|	ВЫБОР
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.НеОбеспечивать)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
		|		КОГДА ОжидаемаяОтгрузка.КОбеспечениюБезРезерва > 0
		|				И ОжидаемаяОтгрузка.РезервироватьПоМереПоступления + ОжидаемаяОтгрузка.ОтложитьРезервирование > 0
		|			ТОГДА ВЫРАЗИТЬ(&ТекстКОбеспечениюИРезервироватьПоМереПоступления КАК СТРОКА(50))
		|		КОГДА ОжидаемаяОтгрузка.КОбеспечениюБезРезерва > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
		|	КОНЕЦ КАК Действие,
		|
		// Поле ДатаПоступления.
		|	ВЫБОР КОГДА СостояниеЗаказа.Состояние В(
		|					ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить),
		|					ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу)) ТОГДА
		|
		|				РасчетДатыПоставкиПереопределяемый.ПлановаяДатаПоставки
		|
		|			ИНАЧЕ
		|
		|				СостояниеЗаказа.ДатаПоступления
		|
		|		КОНЕЦ КАК ДатаПоступления,
		|
		// Поля Способа обеспечения.
		|	ЕСТЬNULL(ВЫРАЗИТЬ(&НадписьЗаказ КАК СТРОКА(5))
		|			+ "" / ""
		|			+ ВЫРАЗИТЬ(РасчетСпособаОбеспеченияПереопределяемый.Ссылка КАК Справочник.СпособыОбеспеченияПотребностей).Наименование,
		|		 """") КАК СпособОбеспеченияНаименование,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(РасчетСпособаОбеспеченияПереопределяемый.Ссылка КАК Справочник.СпособыОбеспеченияПотребностей),
		|		ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка)) КАК СпособОбеспечения,
		|
		// Поле ДатаОтгрузкиИсполнима.
		|	СостояниеЗаказа.ЖелаемаяДатаОтгрузки = ДАТАВРЕМЯ(1,1,1)
		|		ИЛИ ВЫБОР
		|				КОГДА СостояниеЗаказа.ЖелаемаяДатаОтгрузки < &НачалоТекущегоДня
		|					ТОГДА &НачалоТекущегоДня
		|				ИНАЧЕ СостояниеЗаказа.ЖелаемаяДатаОтгрузки
		|			КОНЕЦ
		|				>= ВЫБОР
		|						КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате)
		|							ТОГДА
		|								ВЫБОР
		|									КОГДА СостояниеЗаказа.ДатаПоступления < &НачалоТекущегоДня
		|										ТОГДА &НачалоТекущегоДня
		|									ИНАЧЕ СостояниеЗаказа.ДатаПоступления
		|								КОНЕЦ
		|						КОГДА СостояниеЗаказа.Состояние В(
		|								ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу),
		|								ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить)) ТОГДА
		|							РасчетДатыПоставкиПереопределяемый.ПлановаяДатаПоставки
		|						ИНАЧЕ
		|							ДАТАВРЕМЯ(1,1,1)
		|					КОНЕЦ КАК ДатаОтгрузкиИсполнима,
		|
		|	СостояниеЗаказа.ДатаПоступления КАК ДатаПоступленияДляУпорядочивания,
		|	СостояниеЗаказа.Состояние КАК СостояниеДляУпорядочивания,
		|	ЛОЖЬ КАК МожноОтгрузитьИзДоступногоОстатка,
		|	ЛОЖЬ КАК МожноОтгрузитьИзНаличия
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК СостояниеЗаказа
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|		ПО РеестрДокументов.Ссылка = СостояниеЗаказа.ЗаказНаОтгрузку
		|		 И НЕ РеестрДокументов.ДополнительнаяЗапись
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ОжидаемаяОтгрузка
		|		ПО ОжидаемаяОтгрузка.ЗаказНаОтгрузку = СостояниеЗаказа.ЗаказНаОтгрузку
		|		 И ОжидаемаяОтгрузка.ЖелаемаяДатаОтгрузки = СостояниеЗаказа.ЖелаемаяДатаОтгрузки
		|		 И ОжидаемаяОтгрузка.Номенклатура = СостояниеЗаказа.Номенклатура
		|		 И ОжидаемаяОтгрузка.Характеристика = СостояниеЗаказа.Характеристика
		|		 И ОжидаемаяОтгрузка.Склад = СостояниеЗаказа.Склад
		|		 И ОжидаемаяОтгрузка.Назначение = СостояниеЗаказа.Назначение
		|		 И ОжидаемаяОтгрузка.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|
		#Вставка
		//++ СкребковЮМ 11.03.26
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК РаспоряжениеПоЭтапу
		|		ПО СостояниеЗаказа.ЗаказНаПоступление ССЫЛКА Документ.ЭтапПроизводства2_2
		|		 И СостояниеЗаказа.ЗаказНаПоступление.Распоряжение = РаспоряжениеПоЭтапу.Ссылка
		//-- СкребковЮМ 11.03.26
		#КонецВставки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетСпособаОбеспеченияПереопределяемый ПО ИСТИНА
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПереопределяемый ПО ИСТИНА
		|
		|ГДЕ
		|	ВЫБОР
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)
		|				И СостояниеЗаказа.Зарезервировано > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		ИНАЧЕ СостояниеЗаказа.Состояние
		|	КОНЕЦ В (&Состояния)
		|	И ТИПЗНАЧЕНИЯ(СостояниеЗаказа.ЗаказНаОтгрузку) В (&ДоступныеТипыЗаказов)
		|	И(СостояниеЗаказа.Состояние <> ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате)
		|			И СостояниеЗаказа.Состояние <> ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу)
		|		ИЛИ &Ожидается
		|		ИЛИ &ОжидаетсяНеВСрок
		|			И СостояниеЗаказа.ЖелаемаяДатаОтгрузки <> ДАТАВРЕМЯ(1, 1, 1)
		|			И СостояниеЗаказа.ДатаПоступления <> ДАТАВРЕМЯ(1, 1, 1)
		|			И ВЫБОР КОГДА СостояниеЗаказа.ЖелаемаяДатаОтгрузки < &НачалоТекущегоДня ТОГДА
		|						&НачалоТекущегоДня
		|					ИНАЧЕ
		|						СостояниеЗаказа.ЖелаемаяДатаОтгрузки
		|				КОНЕЦ < СостояниеЗаказа.ДатаПоступления)
		|	И НЕ СостояниеЗаказа.ЗаказНаОтгрузку В(&ИсключаемыеЗаказы)
		|{ГДЕ
		|	ВЫБОР
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)
		|				И СостояниеЗаказа.Зарезервировано > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		ИНАЧЕ СостояниеЗаказа.Состояние
		|	КОНЕЦ КАК Состояние}";
			
	ПодстановкаЗаказНаОтгрузку = "СостояниеЗаказа.ЗаказНаОтгрузку";
	Если ПодменятьТекущийЗаказ Тогда

		ПодстановкаЗаказНаОтгрузку =
			"ВЫБОР КОГДА СостояниеЗаказа.ЗаказНаОтгрузку = &ТекущийЗаказ ТОГДА
			|					ВЫРАЗИТЬ(&НадписьТекущийЗаказ КАК СТРОКА(20))
			|			ИНАЧЕ
			|				СостояниеЗаказа.ЗаказНаОтгрузку
			|		КОНЕЦ";

	КонецЕсли;

	Если ИмяЭлемента = Элементы.Список.Имя Тогда

		ТекстЗапроса = ТекстЗапроса + "
			|{ГДЕ
			|	СостояниеЗаказа.ЗаказНаОтгрузку = &ЗаказНаОтгрузку}
			|{ГДЕ
			|	СостояниеЗаказа.Номенклатура     = &Номенклатура
			|	И СостояниеЗаказа.Характеристика = &Характеристика
			|	И СостояниеЗаказа.Склад          = &Склад}";

	ИначеЕсли ИмяЭлемента = Элементы.СписокЗаказы.Имя Тогда

		ТекстЗапроса = ТекстЗапроса + "
			|{ГДЕ
			|	&Склад = СостояниеЗаказа.Склад}
			|{ГДЕ
			|	&Менеджер = ЕСТЬNULL(РеестрДокументов.Ответственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))}
			|{ГДЕ
			|	&Клиент = ЕСТЬNULL(РеестрДокументов.Партнер, ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))}
			|{ГДЕ
			|	СостояниеЗаказа.ЗаказНаОтгрузку В(&ЗаказыНаОтгрузку)}";

	ИначеЕсли ИмяЭлемента = Элементы.Набор.Имя Тогда

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрСведений.РаспределениеЗапасов", "ИмитацияОтражения");
		ТекстЗапроса = ТекстЗапроса + "
			|	И СостояниеЗаказа.ЗаказНаОтгрузку В(
			|		ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			Движения.Заказ КАК ЗаказНаОтгрузку
			|		ИЗ
			|			ДвиженияПриЗаписи КАК Движения)
			|УПОРЯДОЧИТЬ ПО
			|	СостояниеДляУпорядочивания,
			|	Номенклатура,
			|	Характеристика,
			|	Склад,
			|	Назначение,
			|	ЗаказНаОтгрузку,
			|	ЖелаемаяДатаОтгрузки,
			|	ЗаказНаПоступление,
			|	ДатаПоступленияДляУпорядочивания";

	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗаказНаОтгрузкуПереопределяемый", ПодстановкаЗаказНаОтгрузку);

	Если АвторизованВнешнийПользователь Тогда

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетСпособаОбеспеченияПереопределяемый.Ссылка", "NULL");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетСпособаОбеспеченияПереопределяемый ПО ИСТИНА", "");

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетДатыПоставкиПереопределяемый.ПлановаяДатаПоставки", "ДАТАВРЕМЯ(1, 1, 1)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПереопределяемый ПО ИСТИНА", "");

	Иначе

		Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиОсновногоСпособаОбеспечения(
			"СостояниеЗаказа.Номенклатура",
			"СостояниеЗаказа.Характеристика",
			"СостояниеЗаказа.Склад",
			"СостояниеЗаказа.Состояние В(
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу),
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить))");

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетСпособаОбеспеченияПереопределяемый.Ссылка", Подстановки.Поле);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетСпособаОбеспеченияПереопределяемый ПО ИСТИНА",
			Подстановки.Соединения);

		Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиПлановойДатыПоставки(
			Подстановки.Поле, "&НачалоЭтогоДня", Ложь, Истина);

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетДатыПоставкиПереопределяемый.ПлановаяДатаПоставки", Подстановки.Поле);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПереопределяемый ПО ИСТИНА",
			Подстановки.Соединения);

		Тексты = Новый Массив();
		ТекстВременнойТаблицы = ОбеспечениеВДокументахСервер.ВременнаяТаблицаГодыГрафикаПредприятия();
		Тексты.Добавить(ТекстВременнойТаблицы);
		Тексты.Добавить(ТекстЗапроса);
		ТекстЗапроса = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());

	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ СкребковЮМ 11.03.26
&НаСервере
Процедура cbr_ПодготовитьФорму()
	
	Если ФормыУХ.ЭлементыФормыУХУжеСозданы(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементСписокЗаказов = Элементы.СписокЗаказы;
	ЭлементДоВставки = Элементы.СписокЗаказыЖелаемаяДатаОтгрузки;
	СтрокаСписка = "СписокЗаказы";
	Если КонтекстИспользования = "ЗАКАЗ" Тогда
		ЭлементСписокЗаказов = Элементы.Список;
		ЭлементДоВставки = Элементы.СписокЖелаемаяДатаОтгрузки;
		СтрокаСписка = "Список";
	КонецЕсли;
	
	СписокЗаказыКлиент = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыКлиент",
												"Клиент",
												СтрокаСписка + ".Клиент",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	СписокЗаказыДатаЗаказаНаПроизводство = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыДатаЗаказаНаПроизводство",
												"Дата Заказа на производство",
												СтрокаСписка + ".ДатаЗаказаНаПроизводство",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	СписокЗаказыДатаПостановкиВПлан = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыДатаПостановкиВПлан",
												"Дата постановки в план",
												СтрокаСписка + ".ДатаПостановкиВПлан",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	СписокЗаказыМенедежер = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыМенедежер",
												"Менеджер",
												СтрокаСписка + ".Менеджер",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	СписокЗаказыАвтор = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыАвтор",
												"Автор",
												СтрокаСписка + ".Автор",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	СписокЗаказыЗаказКлиента = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыЗаказКлиента",
												"Заказ клиента",
												СтрокаСписка + ".ЗаказКлиента",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	ФормыУХ.ЭлементыФормыУХДобавлены(ЭтаФорма);
	
КонецПроцедуры //-- СкребковЮМ 11.03.26

#КонецОбласти
